import pytest


@pytest.mark.parametrize(
    "stdin, expected",
    [
        ('1260\n', ['500원 2개', '100원 2개', '50원 1개', '10원 1개']),
        ('0\n', ['500원 0개', '100원 0개', '50원 0개', '10원 0개']),
        ('990\n', ['500원 1개', '100원 4개', '50원 1개', '10원 4개']),
        ('500\n', ['500원 1개', '100원 0개', '50원 0개', '10원 0개']),
        ('40\n', ['500원 0개', '100원 0개', '50원 0개', '10원 4개']),
        ('9870\n', ['500원 19개', '100원 3개', '50원 1개', '10원 2개']),
    ],
)
def test_change(run, stdin, expected):
    assert run("problem_01", stdin) == expected
